Обработки/Reports/_ПереченьДепозитовИМНОАтомфонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПереченьДепозитовИМНОАтомфонд</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПереченьДепозитовИМНОАтомфонд/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Перечень депозитов и МНО (Атомфонд)",
		"0.14",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтотОбъект, НастройкиОтчета.ВариантОтчета);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	
	Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокФормирования");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("АвтоматическаяОтправка");
	Настройки.Добавить("АдресЭлектроннойПочты");
	Настройки.Добавить("АдресОтправителя");
	
	Возврат Настройки;

КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТекущийВариант = СхемаКомпоновкиДанных.ВариантыНастроек.Найти(РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект));
	
	Если ТекущийВариант <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ТекущийВариант.Настройки);
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.Настройки;
	Параметры = Настройки.ПараметрыДанных;
	
	Параметры.УстановитьЗначениеПараметра("НачалоПериода",					Новый Граница(ЭтотОбъект.Период.ДатаНачала, ВидГраницы.Включая));
	Параметры.УстановитьЗначениеПараметра("ОкончаниеПериода",				Новый Граница(ЭтотОбъект.Период.ДатаОкончания, ВидГраницы.Включая));
	Параметры.УстановитьЗначениеПараметра("ДатаОкончанияПериода",			КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Параметры.УстановитьЗначениеПараметра("ДатаНачалаПериода",				ЭтотОбъект.Период.ДатаНачала);
	Параметры.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);	
	Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.УстановитьЗначениеПараметра("НомерДоговора",             	  	ЭтотОбъект.СчетДоверительногоУправления.НомерДоговора);
	Параметры.УстановитьЗначениеПараметра("РуДата", 						Справочники.ВнешниеСистемы.РуДата);
	Параметры.УстановитьЗначениеПараметра("ВидРейтинга", 					Перечисления.ВидыРейтингов.Кредитный);
	
	// Выполняем программную компоновку
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);	
	
КонецПроцедуры
